src/cf/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Организации</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл) Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>(Регл) Код причины постановки на учет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Comment>(Регл) </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Comment>(Регл) </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджерПокупателя</Name>
					<Comment>(Упр) Основной менеджер</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеОписание</Name>
					<Comment>(Общ) Дополнительное описание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеРаботыСтрокой</Name>
					<Comment>(Общ) Расписание работы строкой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеКонтактноеЛицо</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатОтдельнаяГруппировкаПриКомплектации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретОтправкиSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретОтправкиЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильОбменаССервисомСтрахования</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПрофилиОбменаСВнешнимиСистемами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпCoMagicID</Name>
					<Comment>Идентификатор контакта в системе CoMagic</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпПользовательДляПереключенияЗвонков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласенНаПовышение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласенНаПонижение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредпочитаемыйТипТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредпочитаемыйКлассТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКлассыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПунктыНазначения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктНазначения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступенС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступенПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Грузоотправители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Грузополучатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияКонтактнойИнформации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияКПП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonForms/уатПодборЗаказовПеревозчику/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДокументПодбора", ДокументПодбора);
	Если Параметры.Свойство("Перевозчик") Тогда
		Отбор_Контрагент = Параметры.Перевозчик;
	КонецЕсли;
	Если Параметры.Свойство("Организация") Тогда
		Отбор_Организация = Параметры.Организация;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаВыезда) Тогда
		ДатаВыезда = ТекущаяДатаСеанса();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Отбор_Контрагент) Тогда
		Отбор_Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	ВосстановитьНастройки();
	УстановитьЦветаСтатусов();
	
	ЗаказыПеревозчику.Параметры.УстановитьЗначениеПараметра("ДатаИВремяОтправленияС",  '00010101');
	ЗаказыПеревозчику.Параметры.УстановитьЗначениеПараметра("ДатаИВремяОтправленияПо", '00010101');
	ЗаказыПеревозчику.Параметры.УстановитьЗначениеПараметра("ОтборСтатус", Ложь);
	ЗаказыПеревозчику.Параметры.УстановитьЗначениеПараметра("МассивЗаказовДляСтатусов", Новый Массив);

	ОбновитьДанныеПоЗаказамПеревозчику();
	УстановитьВидимостьДоступность();
	УстановитьБыстрыйОтборПоСтатусу();
	
	ПредставлениеЕдиницыИзмеренияВеса = уатОбщегоНазначенияПовтИсп.ПолучитьПредставлениеОсновнойЕдиницыИзмеренияВеса();
	Если ЗначениеЗаполнено(ПредставлениеЕдиницыИзмеренияВеса) Тогда
		Элементы.ПодобранныеЗаказыВес.Заголовок = НСтр("en='Weight';ru='Вес'") + ", " + ПредставлениеЕдиницыИзмеренияВеса;
	КонецЕсли;
	
	ЗапрещенныеВОтбореПоля = Новый Массив;
	ЗапрещенныеВОтбореПоля.Добавить("СтатусЗаказа");
	ЗапрещенныеВОтбореПоля.Добавить("СтатусОбработкиСопроводительныхДокументов");
	ЗаказыПеревозчику.УстановитьОграниченияИспользованияВОтборе(ЗапрещенныеВОтбореПоля);
	ЗаказыПеревозчику.УстановитьОграниченияИспользованияВПорядке(ЗапрещенныеВОтбореПоля);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда 
		Возврат;
	КонецЕсли;
	
	СохранитьНастройки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Отбор_СтатусДокументаПриИзменении(Элемент)
	
	УстановитьБыстрыйОтборПоСтатусу();
	СохранитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура Отбор_КонтрагентПриИзменении(Элемент)
	Если Отбор_Контрагент = Неопределено Тогда
		Отбор_Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗаказыПеревозчику, "Контрагент", Отбор_Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура Отбор_ОрганизацияПриИзменении(Элемент)
	Если Отбор_Организация = Неопределено Тогда
		Отбор_Организация = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗаказыПеревозчику, "Организация", Отбор_Организация);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрыватьФормуПриВыбореПриИзменении(Элемент)
	
	СохранитьНастройки();
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаКоличествоДнейОтДатыВыездаПриИзменении(Элемент)
	Если НастройкаКоличествоДнейОтДатыВыездаОчистка Тогда
		НастройкаКоличествоДнейОтДатыВыездаОчистка	 = Ложь;	
	Иначе
		НастройкаКоличествоДнейОтДатыВыездаИзменена	 = Истина;
		Элементы.НастройкаКоличествоДнейОтДатыВыезда.ФорматРедактирования = "";
	КонецЕсли;
	ОбновитьДанныеПоЗаказамПеревозчику();

КонецПроцедуры

&НаКлиенте
Процедура НастройкаКоличествоДнейОтДатыВыездаНазадПриИзменении(Элемент)
	Если НастройкаКоличествоДнейОтДатыВыездаНазадОчистка Тогда
		НастройкаКоличествоДнейОтДатыВыездаНазадОчистка	 = Ложь;	
	Иначе
		НастройкаКоличествоДнейОтДатыВыездаНазадИзменена = Истина;
		Элементы.НастройкаКоличествоДнейОтДатыВыездаНазад.ФорматРедактирования = "";
	КонецЕсли;
	ОбновитьДанныеПоЗаказамПеревозчику();

КонецПроцедуры

&НаКлиенте
Процедура НастройкаКоличествоДнейОтДатыВыездаНазадОчистка(Элемент, СтандартнаяОбработка)
	НастройкаКоличествоДнейОтДатыВыездаНазадИзменена = Ложь;
	НастройкаКоличествоДнейОтДатыВыездаНазадОчистка  = Истина;
	Элементы.НастройкаКоличествоДнейОтДатыВыездаНазад.ФорматРедактирования = "ЧН=";
КонецПроцедуры

&НаКлиенте
Процедура НастройкаКоличествоДнейОтДатыВыездаОчистка(Элемент, СтандартнаяОбработка)
	НастройкаКоличествоДнейОтДатыВыездаИзменена = Ложь;
	НастройкаКоличествоДнейОтДатыВыездаОчистка  = Истина;
	Элементы.НастройкаКоличествоДнейОтДатыВыезда.ФорматРедактирования = "ЧН=";
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыездаПриИзменении(Элемент)
	ОбновитьДанныеПоЗаказамПеревозчику();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ЗаказыНаТС

&НаКлиенте
Процедура ЗаказыПеревозчикуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ТипЗнч(ВыбраннаяСтрока) = Тип("ДокументСсылка.уатЗаказПеревозчику_уэ") Тогда 
		Возврат;
	КонецЕсли;
	
	ВыборЗаказаПеревозчику(ВыбраннаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ПодобранныеЗаказы

&НаКлиенте
Процедура ПодобранныеЗаказыПослеУдаления(Элемент)
	
	ПодобранныеЗаказыОбновитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобранныеЗаказыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ЕстьСтрокиЗаказов = Ложь;
	Для Каждого ТекСтрока Из ПараметрыПеретаскивания.Значение Цикл 
		Если ТипЗнч(ТекСтрока) = Тип("ДокументСсылка.уатЗаказПеревозчику_уэ") Тогда 
			ЕстьСтрокиЗаказов = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьСтрокиЗаказов Тогда 
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.НеОбрабатывать;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобранныеЗаказыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если ПараметрыПеретаскивания.Значение.Количество() = 1 Тогда 
		Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("ДокументСсылка.уатЗаказПеревозчику_уэ") Тогда 
			ВыборЗаказаПеревозчику(ПараметрыПеретаскивания.Значение[0]);
		КонецЕсли;
		
	Иначе 
		Для Каждого ТекЗаказ Из ПараметрыПеретаскивания.Значение Цикл 
			Если ТипЗнч(ТекЗаказ) = Тип("ДокументСсылка.уатЗаказГрузоотправителя") Тогда 
				ВыборЗаказаПеревозчику(ТекЗаказ, Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиЗаказВВыбранные(Команда)
	
	ТекущаяСтрока = Элементы.ЗаказыПеревозчику.ТекущаяСтрока;
	
	Если Не ТипЗнч(ТекущаяСтрока) = Тип("ДокументСсылка.уатЗаказПеревозчику_уэ") Тогда 
		Возврат;
	КонецЕсли;
	
	ВыборЗаказаПеревозчику(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиПодобранныеВДокумент(Команда)
	
	ЗакрытьФормуСПодбором();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВосстановитьНастройки()
	
	ТолькоНеРазмещенные = Истина;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураНастроек = ХранилищеНастроекДанныхФорм.Загрузить(
		"ОбщаяФорма.уатПодборЗаказовПеревозчику", 
		"ОбщиеНастройкиПодбора"
	); 
	
	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		СтруктураНастроек.Свойство("ЗакрыватьФормуПриВыборе",                          ЗакрыватьФормуПриВыборе);
		СтруктураНастроек.Свойство("НастройкаКоличествоДнейОтДатыВыездаНазад",         НастройкаКоличествоДнейОтДатыВыездаНазад);
		СтруктураНастроек.Свойство("НастройкаКоличествоДнейОтДатыВыезда",              НастройкаКоличествоДнейОтДатыВыезда);
		СтруктураНастроек.Свойство("НастройкаКоличествоДнейОтДатыВыездаИзменена",      НастройкаКоличествоДнейОтДатыВыездаИзменена);
		СтруктураНастроек.Свойство("НастройкаКоличествоДнейОтДатыВыездаНазадИзменена", НастройкаКоличествоДнейОтДатыВыездаНазадИзменена);
		
		Если НастройкаКоличествоДнейОтДатыВыездаИзменена Тогда
			Элементы.НастройкаКоличествоДнейОтДатыВыезда.ФорматРедактирования = ""; 
		Иначе
			НастройкаКоличествоДнейОтДатыВыезда = 45;
		КонецЕсли;
		Если НастройкаКоличествоДнейОтДатыВыездаНазадИзменена Тогда
			Элементы.НастройкаКоличествоДнейОтДатыВыездаНазад.ФорматРедактирования = "";
		Иначе  
			НастройкаКоличествоДнейОтДатыВыездаНазад = 45;
		КонецЕсли;
	КонецЕсли;
	
	Отбор_СтатусДокумента = ХранилищеНастроекДанныхФорм.Загрузить(
		"ОбщаяФорма.уатПодборЗаказовПеревозчику", 
		"НастройкиОтбора_"+ДокументПодбора
	); 
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураНастроек = Новый Структура();
	СтруктураНастроек.Вставить("ЗакрыватьФормуПриВыборе",                          ЗакрыватьФормуПриВыборе);
	СтруктураНастроек.Вставить("НастройкаКоличествоДнейОтДатыВыезда",              НастройкаКоличествоДнейОтДатыВыезда); 
	СтруктураНастроек.Вставить("НастройкаКоличествоДнейОтДатыВыездаНазад",         НастройкаКоличествоДнейОтДатыВыездаНазад);
	СтруктураНастроек.Вставить("НастройкаКоличествоДнейОтДатыВыездаИзменена",      НастройкаКоличествоДнейОтДатыВыездаИзменена);
	СтруктураНастроек.Вставить("НастройкаКоличествоДнейОтДатыВыездаНазадИзменена", НастройкаКоличествоДнейОтДатыВыездаНазадИзменена);
	
	ХранилищеНастроекДанныхФорм.Сохранить(
		"ОбщаяФорма.уатПодборЗаказовПеревозчику", 
		"ОбщиеНастройкиПодбора", 
		СтруктураНастроек
	);
	
	ХранилищеНастроекДанныхФорм.Сохранить(
		"ОбщаяФорма.уатПодборЗаказов", 
		"НастройкиОтбора_"+ДокументПодбора, 
		Отбор_СтатусДокумента
	);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Если ЗакрыватьФормуПриВыборе Тогда 
		Элементы.ПеренестиЗаказВВыбранные.Заголовок      = НСтр("en='Move document';ru='Перенести в документ'");
		Элементы.ПеренестиЗаказВВыбранные.Отображение    = ОтображениеКнопки.Текст;
		Элементы.ПеренестиЗаказВВыбранные.Шрифт          = Новый Шрифт(Элементы.ПеренестиЗаказВВыбранные.Шрифт,,, Истина);
		Элементы.ПеренестиЗаказВВыбранные.ЦветФона       = Новый Цвет(255, 227, 24);
		Элементы.ПодобранныеЗаказы.Видимость             = Ложь;
		Элементы.ПеренестиПодобранныеВДокумент.Видимость = Ложь;
	Иначе 
		Элементы.ПеренестиЗаказВВыбранные.Заголовок      = НСтр("en='Select';ru='Выбрать'");
		Элементы.ПеренестиЗаказВВыбранные.Отображение    = ОтображениеКнопки.КартинкаИТекст;
		Элементы.ПеренестиЗаказВВыбранные.Шрифт          = Новый Шрифт(Элементы.ПеренестиЗаказВВыбранные.Шрифт,,, Ложь);
		Элементы.ПеренестиЗаказВВыбранные.ЦветФона       = Новый Цвет();
		Элементы.ПодобранныеЗаказы.Видимость             = Истина;
		Элементы.ПеренестиПодобранныеВДокумент.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЦветаСтатусов()
	
	мсвУдаляемыхЭлементов = Новый Массив();
	Для Каждого ЭлементУсловногоОформления Из УсловноеОформление.Элементы Цикл
		Если ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "Предустановленный" Тогда
			мсвУдаляемыхЭлементов.Добавить(ЭлементУсловногоОформления);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементУсловногоОформления Из мсвУдаляемыхЭлементов Цикл
		УсловноеОформление.Элементы.Удалить(ЭлементУсловногоОформления);
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатСтатусы_уэ.Ссылка,
	|	уатСтатусы_уэ.Наименование,
	|	уатСтатусы_уэ.ЦветФонаПоУмолчанию,
	|	уатСтатусы_уэ.ЦветТекстаПоУмолчанию
	|ИЗ
	|	Справочник.уатСтатусы_уэ КАК уатСтатусы_уэ
	|ГДЕ
	|	НЕ уатСтатусы_уэ.ПометкаУдаления
	|	И уатСтатусы_уэ.ДействуетНаЗаказыГрузоотправителей";
	
	ВыборкаЦвета = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЦвета.Следующий() Цикл 
		ЦветФона   = Неопределено;
		ЦветТекста = Неопределено;
		
		ХранилищеЦветФона = ВыборкаЦвета.ЦветФонаПоУмолчанию;
		Если Не ХранилищеЦветФона = Неопределено Тогда 
			ДанныеЦветФона = ХранилищеЦветФона.Получить();
			Если Не ДанныеЦветФона = Неопределено И ТипЗнч(ДанныеЦветФона) = Тип("Цвет") Тогда
				ЦветФона = ДанныеЦветФона;
			КонецЕсли;
		КонецЕсли;
		
		ХранилищеЦветТекста = ВыборкаЦвета.ЦветТекстаПоУмолчанию;
		Если Не ХранилищеЦветТекста = Неопределено Тогда 
			ДанныеЦветТекста = ХранилищеЦветТекста.Получить();
			Если Не ДанныеЦветТекста = Неопределено И ТипЗнч(ДанныеЦветТекста) = Тип("Цвет") Тогда
				ЦветТекста = ДанныеЦветТекста;
			КонецЕсли;
		КонецЕсли;
		
		Если ЦветТекста = Неопределено И ЦветФона = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗаказыПеревозчику.Статус");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ВыборкаЦвета.Ссылка;
		ЭлементОтбора.Использование  = Истина;
		
		Если Не ЦветТекста = Неопределено Тогда 
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветТекста);
		КонецЕсли;
		
		Если Не ЦветФона = Неопределено Тогда 
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
		КонецЕсли;
		
		ЭлементУсловногоОформления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "Предустановленный";
		ЭлементУсловногоОформления.Представление = НСтр("en='By status color';ru='По цвету статуса'") + " " + ВыборкаЦвета.Наименование;
		ЭлементУсловногоОформления.Использование = Истина;
		
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ЗаказыПеревозчикуСтатусВыполнения");
		ПолеОформления.Использование = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоЗаказамПеревозчику()
	
	Если НЕ ЗначениеЗаполнено(ДатаВыезда) Тогда
		ТекДатаВыезда = ТекущаяДатаСеанса();
	Иначе
		ТекДатаВыезда = ДатаВыезда;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаВыезда)
		ИЛИ ЗначениеЗаполнено(НастройкаКоличествоДнейОтДатыВыездаНазад)
		ИЛИ ЗначениеЗаполнено(НастройкаКоличествоДнейОтДатыВыезда) Тогда  
		
		ДатаНачала = ?(НачалоДня(ТекДатаВыезда) = '00010101', '00010101', НачалоДня(ТекДатаВыезда)
		- НастройкаКоличествоДнейОтДатыВыездаНазад * 86400);
		ДатаОкончания  = ?(НачалоДня(ТекДатаВыезда) = '00010101', '39991231', КонецДня(НачалоДня(ТекДатаВыезда)
		+ НастройкаКоличествоДнейОтДатыВыезда * 86400));      
	Иначе
		ДатаНачала    = '00010101';
		ДатаОкончания = '00010101';
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗаказыПеревозчику, "ДатаИВремяОтправленияС",  ДатаНачала);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗаказыПеревозчику, "ДатаИВремяОтправленияПо", ДатаОкончания);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗаказыПеревозчику, "Контрагент", Отбор_Контрагент);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗаказыПеревозчику, "Организация", Отбор_Организация);
	
	Элементы.ЗаказыПеревозчику.Обновить();
	
КонецПроцедуры

&НаСервере
Функция ВыборЗаказаСервер(ЗаказПеревозчику)
	
	РезультатВыбора = Новый Структура("ОткрыватьФормуВыбораГруза, ГрузыДляПереноса", Ложь, Новый Массив());
	
	ТабГрузов = ПолучитьСписокГрузовПЗаказуПеревозчикуДляПодбора(ЗаказПеревозчику);
	
	Для Каждого ТекСтрока Из ТабГрузов Цикл 
		ДанныеСтроки = Новый Структура();
		ДанныеСтроки.Вставить("КодГруза",             ТекСтрока.КодГруза);
		ДанныеСтроки.Вставить("ЗаказНаТС",            ТекСтрока.ЗаказНаТС);
		ДанныеСтроки.Вставить("Вес",                  ТекСтрока.Вес);
		ДанныеСтроки.Вставить("ВидПодвижногоСостава", ТекСтрока.ВидПодвижногоСостава);
		ДанныеСтроки.Вставить("КоличествоВагонов",    ТекСтрока.Подтверждено);
		
		РезультатВыбора.ГрузыДляПереноса.Добавить(ДанныеСтроки);
	КонецЦикла;
	
	Возврат РезультатВыбора;
	
КонецФункции // ВыборЗаказаСервер()

&НаКлиенте
Процедура ЗаказыПеревозчикуВыборГрузов(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекГруз Из РезультатЗакрытия Цикл
		
		НайдСтроки = ПодобранныеЗаказы.НайтиСтроки(Новый Структура("Заказ, КодГруза, ВидПодвижногоСостава", ТекГруз.ЗаказНаТС, ТекГруз.КодГруза, ТекГруз.ВидПодвижногоСостава));
		
		Если НайдСтроки.Количество() = 0 Тогда 
			НовСтрока                      = ПодобранныеЗаказы.Добавить();
			НовСтрока.Заказ                = ТекГруз.ЗаказНаТС;
			НовСтрока.КодГруза             = ТекГруз.КодГруза;
			НовСтрока.ВидПодвижногоСостава = ТекГруз.ВидПодвижногоСостава;
			НовСтрока.КоличествоВагонов    = ТекГруз.КоличествоВагонов;
			НовСтрока.Вес                  = ТекГруз.Вес;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗакрыватьФормуПриВыборе Тогда 
		ЗакрытьФормуСПодбором();
	КонецЕсли;
	
	ПодобранныеЗаказыОбновитьИтоги();
	
	ОбновитьДанныеПоЗаказамПеревозчику();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЗаказаПеревозчику(ВыбранныйЗаказ, БезВыбораГрузов=Ложь)
	
	РазмещенныеГрузы = Новый Массив();
	
	РезультатВыбора = ВыборЗаказаСервер(ВыбранныйЗаказ);
	
	ЗаказыПеревозчикуВыборГрузов(РезультатВыбора.ГрузыДляПереноса, ВыбранныйЗаказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобранныеЗаказыОбновитьИтоги()
	
	ПодобранныеЗаказыВес = 0;
	
	Для Каждого ТекСтрока Из ПодобранныеЗаказы Цикл 
		ПодобранныеЗаказыВес = ПодобранныеЗаказыВес + ТекСтрока.Вес;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуСПодбором()
	
	РезультатЗакрытия = Новый Структура();
	
	РезультатЗакрытия.Вставить("ДатаВыезда",                            ДатаВыезда);
	РезультатЗакрытия.Вставить("ПодобранныеЗаказы",                     Новый Массив());
	
	Для Каждого ТекСтрока Из ПодобранныеЗаказы Цикл 
		ДанныеСтроки = Новый Структура();
		ДанныеСтроки.Вставить("Заказ",                ТекСтрока.Заказ);
		ДанныеСтроки.Вставить("КодГруза",             ТекСтрока.КодГруза);
		ДанныеСтроки.Вставить("ВидПодвижногоСостава", ТекСтрока.ВидПодвижногоСостава);
		ДанныеСтроки.Вставить("Вес",                  ТекСтрока.Вес);
		ДанныеСтроки.Вставить("КоличествоВагонов",    ТекСтрока.КоличествоВагонов);
		
		РезультатЗакрытия.ПодобранныеЗаказы.Добавить(ДанныеСтроки);
	КонецЦикла;
	
	Закрыть(РезультатЗакрытия);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьБыстрыйОтборПоСтатусу()
	
	Если ЗначениеЗаполнено(Отбор_СтатусДокумента) Тогда
		МассивЗаказовДляСтатусов = ПолучитьМассивЗаказовПоСтатусам(Отбор_СтатусДокумента);
		ЗаказыПеревозчику.Параметры.УстановитьЗначениеПараметра("ОтборСтатус", Истина);
		ЗаказыПеревозчику.Параметры.УстановитьЗначениеПараметра("МассивЗаказовДляСтатусов", МассивЗаказовДляСтатусов);
	Иначе
		ЗаказыПеревозчику.Параметры.УстановитьЗначениеПараметра("ОтборСтатус", Ложь);
		ЗаказыПеревозчику.Параметры.УстановитьЗначениеПараметра("МассивЗаказовДляСтатусов", Новый Массив);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивЗаказовПоСтатусам(Статус)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	уатЗаказПеревозчику_уэ.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.уатЗаказПеревозчику_уэ КАК уатЗаказПеревозчику_уэ
	               |ГДЕ
	               |	уатЗаказПеревозчику_уэ.Проведен
	               |	И уатЗаказПеревозчику_уэ.СтатусВыполнения = &Статус";
	Запрос.УстановитьПараметр("Статус", Статус);
	ВыборкаЗаказ = Запрос.Выполнить().Выбрать();
	
	МассивЗаказовДляСтатусов = Новый Массив();
	Пока ВыборкаЗаказ.Следующий() Цикл
		МассивЗаказовДляСтатусов.Добавить(ВыборкаЗаказ.Ссылка);
	КонецЦикла;

	Возврат МассивЗаказовДляСтатусов;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокГрузовПЗаказуПеревозчикуДляПодбора(ЗаказПеревозчику)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатЗаказПеревозчику_уэПотребностьВВагонах.ЗаказНаТС КАК ЗаказНаТС,
	|	уатЗаказПеревозчику_уэПотребностьВВагонах.КодГруза КАК КодГруза,
	|	уатЗаказПеревозчику_уэПотребностьВВагонах.ТипВагона КАК ВидПодвижногоСостава,
	|	уатЗаказПеревозчику_уэПотребностьВВагонах.Вес КАК Вес,
	|	уатЗаказПеревозчику_уэПотребностьВВагонах.Подтверждено КАК Подтверждено
	|ИЗ
	|	Документ.уатЗаказПеревозчику_уэ.ПотребностьВВагонах КАК уатЗаказПеревозчику_уэПотребностьВВагонах
	|ГДЕ
	|	уатЗаказПеревозчику_уэПотребностьВВагонах.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ЗаказПеревозчику);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
